app/Controllers/c_mas_noticias.php

    public function masNoticias(){
        $segmentos = $this->uri->getSegments();
        $model=new m_noticias();
        $datos['noticias']=$model->findAll();
---
SELECT *
FROM `noticias`