app/Controllers/Home.php

    public function index()
    {

      $segmentos = $this->uri->getSegments();
      $datos['datosNav']=$this->session->get();
      $model=new M_textos();
      $home=$model->findAll();
---
SELECT *
FROM `textos`